;	=========================================================
;		ICON SET LOCALIZATION
;	=========================================================

[IconSet_Iridar_Officer X2IconSetTemplate]
LocName = "Офицер (Iradar)"

[IconSet_Iridar_Soldier X2IconSetTemplate]
LocName = "Солдат (Iradar)"

[IconSet_Iridar_Reaper X2IconSetTemplate]
LocName = "Жнец (Iradar)"

[IconSet_Iridar_Skirmisher X2IconSetTemplate]
LocName = "Заступник (Iradar)"

[IconSet_Iridar_Templar X2IconSetTemplate]
LocName = "Храмовник (Iradar)"

[IconSet_Iridar_Legion X2IconSetTemplate]
LocName = "Легион (Iradar)"

[IconSet_LtKoukassi_Officer X2IconSetTemplate]
LocName = "Офицер (Lt. Koukassi)"

[IconSet_LtKoukassi_Soldier X2IconSetTemplate]
LocName = "Солдат (Lt. Koukassi)"

[IconSet_LtKoukassi_Reaper X2IconSetTemplate]
LocName = "Жнец (Lt. Koukassi)"

[IconSet_LtKoukassi_Skirmisher X2IconSetTemplate]
LocName = "Заступник (Lt. Koukassi)"

[IconSet_LtKoukassi_Templar X2IconSetTemplate]
LocName = "Храмовник (Lt. Koukassi)"

[IconSet_LW2_Officer X2IconSetTemplate]
LocName = "Офицер (Long War 2)"

;	=========================================================
;		RANK NAME SET LOCALIZATION
;	=========================================================

[RankNameSet_Iridar_Officer X2RankNameTemplate]
LocName = "Офицер (Iradar)"
RankNames[0]="Адъютант"
RankNames[1]="Младший офицер"
RankNames[2]="Полевой командир"
RankNames[3]="Лейтенант"
RankNames[4]="Капитан"
RankNames[5]="Майор"
RankNames[6]="Полковник"
RankNames[7]="Генерал" 
RankNames[8]="Маршал"

ShortNames[0]="Ад."
ShortNames[1]="МО"
ShortNames[2]="ПК"
ShortNames[3]="Лт."
ShortNames[4]="Кпт."
ShortNames[5]="Мр."
ShortNames[6]="Плк."
ShortNames[7]="Ген."
ShortNames[8]="Мрш."

[RankNameSet_Iridar_Soldier X2RankNameTemplate]
LocName = "Солдат (Iradar)"
RankNames[0]="Новобранец"
RankNames[1]="Рядовой"
RankNames[2]="Младший капрал"
RankNames[3]="Капрал"
RankNames[4]="Сержант"
RankNames[5]="Штаб-сержант"
RankNames[6]="Тех-сержант"
RankNames[7]="Старший сержант"
RankNames[8]="Мастер-сержант"

ShortNames[0]="Нов."
ShortNames[1]="Ряд."
ShortNames[2]="МлК."
ShortNames[3]="Кпл."
ShortNames[4]="Срж."
ShortNames[5]="ШСрж."
ShortNames[6]="ТСрж."
ShortNames[7]="ССрж."
ShortNames[8]="МСрж."

[RankNameSet_Iridar_Reaper X2RankNameTemplate]
LocName = "Жнец (Iradar)"
RankNames[0] = "Скаут"
RankNames[1] = "Скаут"
RankNames[2] = "Искатель"
RankNames[3] = "Преследователь"
RankNames[4] = "Охотник"
RankNames[5] = "Егерь"
RankNames[6] = "Следопыт"
RankNames[7] = "Сталкер"
RankNames[8] = "Охотник за головами"

ShortNames[0] = "Ск."
ShortNames[1] = "Ск."
ShortNames[2] = "Иск."
ShortNames[3] = "Пр."
ShortNames[4] = "Охт."
ShortNames[5] = "Ег."
ShortNames[6] = "Сл."
ShortNames[7] = "Ст."
ShortNames[8] = "ОГ"

[RankNameSet_Iridar_Skirmisher X2RankNameTemplate]
LocName = "Заступник (Iradar)"
RankNames[0] = "Опцион"
RankNames[1] = "Опцион"
RankNames[2] = "Сигнифер"
RankNames[3] = "Легионер"
RankNames[4] = "Центурион"
RankNames[5] = "Префект"
RankNames[6] = "Трибун"
RankNames[7] = "Легат"
RankNames[8] = "Легат Легиона"

ShortNames[0] = "Опц."
ShortNames[1] = "Опц."
ShortNames[2] = "Сигн."
ShortNames[3] = "Лгн."
ShortNames[4] = "Цент."
ShortNames[5] = "Преф."
ShortNames[6] = "Триб."
ShortNames[7] = "Лег."
ShortNames[8] = "ЛЛ"

[RankNameSet_Iridar_Templar X2RankNameTemplate]
LocName = "Храмовник (Iradar)"
RankNames[0] = "Ученик"
RankNames[1] = "Ученик"
RankNames[2] = "Священник"
RankNames[3] = "Проповедник"
RankNames[4] = "Миссионер"
RankNames[5] = "Фанатик"
RankNames[6] = "Крестоносец"
RankNames[7] = "Грандмастер"
RankNames[8] = "Мессия"

ShortNames[0] = "Уч."
ShortNames[1] = "Уч."
ShortNames[2] = "Свщ."
ShortNames[3] = "Прп."
ShortNames[4] = "Мсс."
ShortNames[5] = "Фнт."
ShortNames[6] = "Крст."
ShortNames[7] = "ГМ"
ShortNames[8] = "Мес."


[RankNameSet_LtKoukassi_Officer X2RankNameTemplate]
LocName = "Lt. Koukassi's Officer"
RankNames[0]="Officer Cadet"
RankNames[1]="Officer Cadet"
RankNames[2]="Second Lieutenant"
RankNames[3]="Lieutenant"
RankNames[4]="Captain"
RankNames[5]="Major"
RankNames[6]="Lieutenant Colonel"
RankNames[7]="Colonel"

ShortNames[0]="Ocdt."
ShortNames[1]="Ocdt."
ShortNames[2]="2Lt."
ShortNames[3]="Lt."
ShortNames[4]="Cpt.."
ShortNames[5]="Maj."
ShortNames[6]="Lt Col."
ShortNames[7]="Col."

[RankNameSet_LtKoukassi_Soldier X2RankNameTemplate]
LocName = "Lt. Koukassi's Soldier"
RankNames[0]="Recruit"
RankNames[1]="Cadet"
RankNames[2]="Marine"
RankNames[3]="Lance Corporal"
RankNames[4]="Corporal"
RankNames[5]="Sergeant"
RankNames[6]="Staff Sergeant"
RankNames[7]="Sergeant Major"

ShortNames[0]="Rk."
ShortNames[1]="Cdt."
ShortNames[2]="Mne."
ShortNames[3]="LCpl."
ShortNames[4]="Cpl."
ShortNames[5]="Sgt."
ShortNames[6]="SSgt."
ShortNames[7]="SM."

[RankNameSet_LtKoukassi_Reaper X2RankNameTemplate]
LocName = "Lt. Koukassi's Reaper"
RankNames[0]="Scout"
RankNames[1]="Commando"
RankNames[2]="Operative"
RankNames[3]="Agent"
RankNames[4]="Special Agent"
RankNames[5]="Sentinel"
RankNames[6]="Master"
RankNames[7]="Commander"

ShortNames[0]="Sct."
ShortNames[1]="Cmd."
ShortNames[2]="Op."
ShortNames[3]="Agt."
ShortNames[4]="SAgt."
ShortNames[5]="Sen."
ShortNames[6]="Mst."
ShortNames[7]="Cmdr."

[RankNameSet_LtKoukassi_Skirmisher X2RankNameTemplate]
LocName = "Lt. Koukassi's Skirmisher"
RankNames[0]="Cadet"
RankNames[1]="Trooper"
RankNames[2]="Veteran"
RankNames[3]="Guard"
RankNames[4]="Sergeant"
RankNames[5]="Lieutenant"
RankNames[6]="Captain"
RankNames[7]="Commander"

ShortNames[0]="Cdt."
ShortNames[1]="Trp."
ShortNames[2]="Vet."
ShortNames[3]="Grd."
ShortNames[4]="Sgt."
ShortNames[5]="Lt."
ShortNames[6]="Cpt."
ShortNames[7]="Cmdr."

[RankNameSet_LtKoukassi_Templar X2RankNameTemplate]
LocName = "Lt. Koukassi's Templar"
RankNames[0]="Initiate"
RankNames[1]="Apprentice"
RankNames[2]="Novice"
RankNames[3]="Acolyte"
RankNames[4]="Knight"
RankNames[5]="Warden"
RankNames[6]="Master"
RankNames[7]="Grand Master"

ShortNames[0]="Int."
ShortNames[1]="Apr."
ShortNames[2]="Nov."
ShortNames[3]="Aco."
ShortNames[4]="Knt."
ShortNames[5]="Wrd."
ShortNames[6]="Mstr."
ShortNames[7]="GMstr."

[RankNameSet_LW2_Soldier X2RankNameTemplate]
LocName = "Long War 2 Soldier"
RankNames[0]="Rookie"
RankNames[1]="Squaddie"
RankNames[2]="Lance Corporal"
RankNames[3]="Corporal"
RankNames[4]="Sergeant"
RankNames[5]="Staff Sergeant"
RankNames[6]="Tech Sergeant"
RankNames[7]="Gunnery Sergeant"
RankNames[8]="Master Sergeant"

ShortNames[0]="Rk"
ShortNames[1]="Sq"
ShortNames[2]="LCpl"
ShortNames[3]="Cpl"
ShortNames[4]="Sgt"
ShortNames[5]="SSgt"
ShortNames[6]="TSgt"
ShortNames[7]="GSgt"
ShortNames[8]="MSgt"

[RankNameSet_LW2_Officer X2RankNameTemplate]
LocName = "Long War 2 Officer"
RankNames[0]="NCO"
RankNames[1]="2nd Lieutenant"
RankNames[2]="1st Lieutenant"
RankNames[3]="Captain"
RankNames[4]="Major"
RankNames[5]="Lieutenant Colonel"
RankNames[6]="Colonel"
RankNames[7]="Field Commander"

ShortNames[0]="NCO"
ShortNames[1]="2Lt"
ShortNames[2]="1Lt"
ShortNames[3]="Capt"
ShortNames[4]="Maj"
ShortNames[5]="LtC"
ShortNames[6]="Col"
ShortNames[7]="Cmdr"

[OFF_MCM_Screen]
str_MOD_LABEL = "Настройки Рангов"
str_GROUP_GENERAL_SETTINGS = "Основные настройки"
str_GROUP_RANK_ICONS = "Наборы иконок для рангов"
str_GROUP_RANK_NAMES = "Наборы названий рангов"
str_GROUP_OFFICER_CLASSES = "Классы Офицеров"

strNoReplacement = "Не заменять"

loc_OFFICER_RANK_NAME_SET_Label = "Названия рангов офицеров"
loc_SOLDIER_RANK_NAME_SET_Label = "Названия рангов солдат"
loc_REAPER_RANK_NAME_SET_Label = "Названия рангов Жнецов"
loc_SKIRMISHER_RANK_NAME_SET_Label = "Названия рангов Заступников"
loc_TEMPLAR_RANK_NAME_SET_Label = "Названия рангов Храмовников"

loc_OFFICER_RANK_ICON_SET_Label = "Иконки рангов офицеров"
loc_SOLDIER_RANK_ICON_SET_Label = "Иконки рангов солдат"
loc_REAPER_RANK_ICON_SET_Label = "Иконки рангов Жнецов"
loc_SKIRMISHER_RANK_ICON_SET_Label = "Иконки рангов Заступников"
loc_TEMPLAR_RANK_ICON_SET_Label = "Иконки рангов Храмовников"

loc_OFFICER_RANK_NAME_SET_Tip = "Набор названий рангов, который будет использован для офицеров. Он будет применен ко всем офицерам, вне зависимости, обычные ли это бойцы, герои фракций или даже ИСКРЫ."
loc_SOLDIER_RANK_NAME_SET_Tip = "Набор названий рангов, который будет использован для обычных солдат XCOM. Он будет применен к солдатам, не являющимся героями фракций или псиониками."
loc_REAPER_RANK_NAME_SET_Tip = "Набор названий рангов, который будет использован для героев фракции Жнецов."
loc_SKIRMISHER_RANK_NAME_SET_Tip = "Набор названий рангов, который будет использован для героев фракции Заступников."
loc_TEMPLAR_RANK_NAME_SET_Tip = "Набор названий рангов, который будет использован для героев фракции Храмовников."

loc_OFFICER_RANK_ICON_SET_Tip = "Набор иконок рангов, который будет использован для офицеров. Он будет применен ко всем офицерам, вне зависимости, обычные ли это бойцы, герои фракций или даже ИСКРЫ."
loc_SOLDIER_RANK_ICON_SET_Tip = "Набор иконок рангов, который будет использован для обычных солдат XCOM. Он будет применен к солдатам, не являющимся героями фракций или псиониками."
loc_REAPER_RANK_ICON_SET_Tip = "Набор иконок рангов, который будет использован для героев фракции Жнецов."
loc_SKIRMISHER_RANK_ICON_SET_Tip = "Набор иконок рангов, который будет использован для героев фракции Заступников."
loc_TEMPLAR_RANK_ICON_SET_Tip = "Набор иконок рангов, который будет использован для героев фракции Храмовников."

REPLACE_CLASS_UNIQUE_RANKS_Label = "Заменить ранги уникальных классов"
REPLACE_CLASS_UNIQUE_RANKS_Tip = "Некоторые классы солдат, вроде Пси-агентов, имеют собственные названия рангов и иконки для них. Если эта опция включена, такие ранги и иконки будут заменены на стандартные, как у прочих бойцов."

MARK_OFFICER_IN_SQUAD_SELECT_Label = "Помечать Командующего на экране выбора отряда"
MARK_OFFICER_IN_SQUAD_SELECT_Tip = "Если эта опция включена, мод будет помечать старшего офицера по званию на экране выбора отряда robojumper's Squad Select."

[X2EventListener_Officer]
strCommandingOfficer = "Командующий"
